---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.GetDuctFittingAndAccessoryData
source: html/c4cf6998-009a-cf51-535d-53c61177fb6e.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.GetDuctFittingAndAccessoryData Method

Returns the fitting and accessory information.

## Syntax (C#)
```csharp
public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData()
```